JayHeng/imxrt-tool-flash-algo/devices/MIMXRT595S/arm/startup_MIMXRT595S_cm33.s
;/*****************************************************************************
; * @file:    startup_MIMXRT595S_cm33.s
; * @purpose: CMSIS Cortex-M33 Core Device Startup File for the
; *           MIMXRT595S_cm33
; * @version: 2.0
; * @date:    2019-7-22
; *
; * Copyright 1997-2016 Freescale Semiconductor, Inc.
; * Copyright 2016-2019 NXP
; * All rights reserved.
; *
; * SPDX-License-Identifier: BSD-3-Clause
; *
; *------- <<< Use Configuration Wizard in Context Menu >>> ------------------
; *
; *****************************************************************************/


                PRESERVE8
                THUMB

; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                IMPORT  |Image$$ARM_LIB_STACK$$ZI$$Limit|

__Vectors       DCD     |Image$$ARM_LIB_STACK$$ZI$$Limit| ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler

                DCD     NMI_Handler
                DCD     HardFault_Handler
                DCD     MemManage_Handler
                DCD     BusFault_Handler
                DCD     UsageFault_Handler
__vector_table_0x1c
                DCD     SecureFault_Handler
                DCD     0x280000                  ;Image length
                DCD     0
                DCD     0
                DCD     SVC_Handler
                DCD     DebugMon_Handler
                DCD     __Vectors                 ;Image load address
                DCD     PendSV_Handler
                DCD     SysTick_Handler

                ; External Interrupts
                DCD     WDT0_IRQHandler  ; Watchdog timer interrupt
                DCD     DMA0_IRQHandler  ; DMA interrupt
                DCD     GPIO_INTA_IRQHandler  ; GPIO Interrupt A
                DCD     GPIO_INTB_IRQHandler  ; GPIO Interrupt B
                DCD     PIN_INT0_IRQHandler  ; General Purpose Input/Output interrupt 0
                DCD     PIN_INT1_IRQHandler  ; General Purpose Input/Output interrupt 1
                DCD     PIN_INT2_IRQHandler  ; General Purpose Input/Output interrupt 2
                DCD     PIN_INT3_IRQHandler  ; General Purpose Input/Output interrupt 3
                DCD     UTICK0_IRQHandler  ; Micro-tick Timer
                DCD     MRT0_IRQHandler  ; Multi-Rate Timer
                DCD     CTIMER0_IRQHandler  ; Standard counter/timer CTIMER0
                DCD     CTIMER1_IRQHandler  ; Standard counter/timer CTIMER1
                DCD     SCT0_IRQHandler  ; SCTimer/PWM
                DCD     CTIMER3_IRQHandler  ; Standard counter/timer CTIMER3
                DCD     FLEXCOMM0_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM1_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM2_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM3_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM4_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM5_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM14_IRQHandler  ; FlexComm interrupt. Standalone SPI
                DCD     FLEXCOMM15_IRQHandler  ; FlexComm interrupt. Standalone I2C
                DCD     ADC0_IRQHandler  ; Analog-to-Digital Converter interrupt
                DCD     MRT1_IRQHandler  ; Multirate Timer interrupt
                DCD     ACMP_IRQHandler  ; Analog comparator Interrupts
                DCD     DMIC0_IRQHandler  ; Digital Microphone Interface interrupt
                DCD     Reserved42_IRQHandler  ; Reserved interrupt
                DCD     HYPERVISOR_IRQHandler  ; Hypervisor interrupt
                DCD     SECURE_VIOLATION_IRQHandler  ; Secure violation interrupt
                DCD     HWVAD0_IRQHandler  ; Hardware Voice Activity Detector interrupt
                DCD     Reserved46_IRQHandler  ; Reserved interrupt
                DCD     RNG_IRQHandler  ; Random Number Generator interrupt
                DCD     RTC_IRQHandler  ; Real Time Clock Alarm interrupt OR Wakeup timer interrupt
                DCD     DSP_TIE_EXPSTATE1_IRQHandler  ; DSP interrupt
                DCD     MU_A_IRQHandler  ; Messaging Unit - Side A
                DCD     PIN_INT4_IRQHandler  ; General Purpose Input/Output interrupt 4
                DCD     PIN_INT5_IRQHandler  ; General Purpose Input/Output interrupt 5
                DCD     PIN_INT6_IRQHandler  ; General Purpose Input/Output interrupt 6
                DCD     PIN_INT7_IRQHandler  ; General Purpose Input/Output interrupt 7
                DCD     CTIMER2_IRQHandler  ; Standard counter/timer CTIMER2
                DCD     CTIMER4_IRQHandler  ; Standard counter/timer CTIMER4
                DCD     OS_EVENT_IRQHandler  ; Event timer M33 Wakeup/interrupt
                DCD     FLEXSPI0_FLEXSPI1_IRQHandler  ; FlexSPI0_IRQ OR FlexSPI1_IRQ
                DCD     FLEXCOMM6_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM7_IRQHandler  ; FlexComm interrupt
                DCD     USDHC0_IRQHandler  ; USDHC interrupt
                DCD     USDHC1_IRQHandler  ; USDHC interrupt
                DCD     SGPIO_INTA_IRQHandler  ; Secure GPIO HS interrupt 0
                DCD     SGPIO_INTB_IRQHandler  ; Secure GPIO HS interrupt 1
                DCD     I3C0_IRQHandler  ; Improved Inter Integrated Circuit 0 interrupt
                DCD     USB0_IRQHandler  ; USB device
                DCD     USB0_NEEDCLK_IRQHandler  ; USB Activity Wake-up Interrupt
                DCD     WDT1_IRQHandler  ; Watchdog timer 1 interrupt
                DCD     USB_PHYDCD_IRQHandler  ; USBPHY DCD interrupt
                DCD     DMA1_IRQHandler  ; DMA interrupt
                DCD     PUF_IRQHandler  ; QuidKey interrupt
                DCD     POWERQUAD_IRQHandler  ; Powerquad interrupt
                DCD     CASPER_IRQHandler  ; Caspar interrupt
                DCD     PMU_PMIC_IRQHandler  ; Power Management Control interrupt
                DCD     HASHCRYPT_IRQHandler  ; SHA interrupt
                DCD     FLEXCOMM8_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM9_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM10_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM11_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM12_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM13_IRQHandler  ; FlexComm interrupt
                DCD     FLEXCOMM16_IRQHandler  ; FlexComm interrupt
                DCD     I3C1_IRQHandler  ; Improved Inter Integrated Circuit 1 interrupt
                DCD     FLEXIO_IRQHandler  ; Flexible I/O interrupt
                DCD     LCDIF_IRQHandler  ; Liquid Crystal Display interface interrupt
                DCD     GPU_IRQHandler  ; Graphics Processor Unit interrupt
                DCD     MIPI_IRQHandler  ; MIPI interrupt
                DCD     Reserved88_IRQHandler  ;
                DCD     SDMA_IRQHandler  ; Smart DMA Engine Controller interrupt

                AREA    |.text|, CODE, READONLY

