JayHeng/imxrt-tool-flash-algo/devices/MIMXRT595S/arm/startup_MIMXRT595S_cm33.s
FLEXCOMM15_IRQHandler\
                PROC
                EXPORT     FLEXCOMM15_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM15_DriverIRQHandler
                BX         R0
                ENDP

ADC0_IRQHandler\
                PROC
                EXPORT     ADC0_IRQHandler        [WEAK]
                LDR        R0, =ADC0_DriverIRQHandler
                BX         R0
                ENDP

MRT1_IRQHandler\
                PROC
                EXPORT     MRT1_IRQHandler        [WEAK]
                LDR        R0, =MRT1_DriverIRQHandler
                BX         R0
                ENDP

ACMP_IRQHandler\
                PROC
                EXPORT     ACMP_IRQHandler        [WEAK]
                LDR        R0, =ACMP_DriverIRQHandler
                BX         R0
                ENDP

DMIC0_IRQHandler\
                PROC
                EXPORT     DMIC0_IRQHandler        [WEAK]
                LDR        R0, =DMIC0_DriverIRQHandler
                BX         R0
                ENDP

Reserved42_IRQHandler\
                PROC
                EXPORT     Reserved42_IRQHandler        [WEAK]
                LDR        R0, =Reserved42_DriverIRQHandler
                BX         R0
                ENDP

HYPERVISOR_IRQHandler\
                PROC
                EXPORT     HYPERVISOR_IRQHandler        [WEAK]
                LDR        R0, =HYPERVISOR_DriverIRQHandler
                BX         R0
                ENDP

SECURE_VIOLATION_IRQHandler\
                PROC
                EXPORT     SECURE_VIOLATION_IRQHandler        [WEAK]
                LDR        R0, =SECURE_VIOLATION_DriverIRQHandler
                BX         R0
                ENDP

HWVAD0_IRQHandler\
                PROC
                EXPORT     HWVAD0_IRQHandler        [WEAK]
                LDR        R0, =HWVAD0_DriverIRQHandler
                BX         R0
                ENDP

Reserved46_IRQHandler\
                PROC
                EXPORT     Reserved46_IRQHandler        [WEAK]
                LDR        R0, =Reserved46_DriverIRQHandler
                BX         R0
                ENDP

RNG_IRQHandler\
                PROC
                EXPORT     RNG_IRQHandler        [WEAK]
                LDR        R0, =RNG_DriverIRQHandler
                BX         R0
                ENDP

RTC_IRQHandler\
                PROC
                EXPORT     RTC_IRQHandler        [WEAK]
                LDR        R0, =RTC_DriverIRQHandler
                BX         R0
                ENDP

DSP_TIE_EXPSTATE1_IRQHandler\
                PROC
                EXPORT     DSP_TIE_EXPSTATE1_IRQHandler        [WEAK]
                LDR        R0, =DSP_TIE_EXPSTATE1_DriverIRQHandler
                BX         R0
                ENDP

MU_A_IRQHandler\
                PROC
                EXPORT     MU_A_IRQHandler        [WEAK]
                LDR        R0, =MU_A_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT4_IRQHandler\
                PROC
                EXPORT     PIN_INT4_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT4_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT5_IRQHandler\
                PROC
                EXPORT     PIN_INT5_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT5_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT6_IRQHandler\
                PROC
                EXPORT     PIN_INT6_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT6_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT7_IRQHandler\
                PROC
                EXPORT     PIN_INT7_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT7_DriverIRQHandler
                BX         R0
                ENDP

CTIMER2_IRQHandler\
                PROC
                EXPORT     CTIMER2_IRQHandler        [WEAK]
                LDR        R0, =CTIMER2_DriverIRQHandler
                BX         R0
                ENDP

CTIMER4_IRQHandler\
                PROC
                EXPORT     CTIMER4_IRQHandler        [WEAK]
                LDR        R0, =CTIMER4_DriverIRQHandler
                BX         R0
                ENDP

OS_EVENT_IRQHandler\
                PROC
                EXPORT     OS_EVENT_IRQHandler        [WEAK]
                LDR        R0, =OS_EVENT_DriverIRQHandler
                BX         R0
                ENDP

FLEXSPI0_FLEXSPI1_IRQHandler\
                PROC
                EXPORT     FLEXSPI0_FLEXSPI1_IRQHandler        [WEAK]
                LDR        R0, =FLEXSPI0_FLEXSPI1_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM6_IRQHandler\
                PROC
                EXPORT     FLEXCOMM6_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM6_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM7_IRQHandler\
                PROC
                EXPORT     FLEXCOMM7_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM7_DriverIRQHandler
                BX         R0
                ENDP

USDHC0_IRQHandler\
                PROC
                EXPORT     USDHC0_IRQHandler        [WEAK]
                LDR        R0, =USDHC0_DriverIRQHandler
                BX         R0
                ENDP

USDHC1_IRQHandler\
                PROC
                EXPORT     USDHC1_IRQHandler        [WEAK]
                LDR        R0, =USDHC1_DriverIRQHandler
                BX         R0
                ENDP

SGPIO_INTA_IRQHandler\
                PROC
                EXPORT     SGPIO_INTA_IRQHandler        [WEAK]
                LDR        R0, =SGPIO_INTA_DriverIRQHandler
                BX         R0
                ENDP

SGPIO_INTB_IRQHandler\
                PROC
                EXPORT     SGPIO_INTB_IRQHandler        [WEAK]
                LDR        R0, =SGPIO_INTB_DriverIRQHandler
                BX         R0
                ENDP

I3C0_IRQHandler\
                PROC
                EXPORT     I3C0_IRQHandler        [WEAK]
                LDR        R0, =I3C0_DriverIRQHandler
                BX         R0
                ENDP

USB0_IRQHandler\
                PROC
                EXPORT     USB0_IRQHandler        [WEAK]
                LDR        R0, =USB0_DriverIRQHandler
                BX         R0
                ENDP

USB0_NEEDCLK_IRQHandler\
                PROC
                EXPORT     USB0_NEEDCLK_IRQHandler        [WEAK]
                LDR        R0, =USB0_NEEDCLK_DriverIRQHandler
                BX         R0
                ENDP

