JayHeng/imxrt-tool-flash-algo/devices/MIMXRT595S/arm/startup_MIMXRT595S_cm33.s
WDT1_IRQHandler\
                PROC
                EXPORT     WDT1_IRQHandler        [WEAK]
                LDR        R0, =WDT1_DriverIRQHandler
                BX         R0
                ENDP

USB_PHYDCD_IRQHandler\
                PROC
                EXPORT     USB_PHYDCD_IRQHandler        [WEAK]
                LDR        R0, =USB_PHYDCD_DriverIRQHandler
                BX         R0
                ENDP

DMA1_IRQHandler\
                PROC
                EXPORT     DMA1_IRQHandler        [WEAK]
                LDR        R0, =DMA1_DriverIRQHandler
                BX         R0
                ENDP

PUF_IRQHandler\
                PROC
                EXPORT     PUF_IRQHandler        [WEAK]
                LDR        R0, =PUF_DriverIRQHandler
                BX         R0
                ENDP

POWERQUAD_IRQHandler\
                PROC
                EXPORT     POWERQUAD_IRQHandler        [WEAK]
                LDR        R0, =POWERQUAD_DriverIRQHandler
                BX         R0
                ENDP

CASPER_IRQHandler\
                PROC
                EXPORT     CASPER_IRQHandler        [WEAK]
                LDR        R0, =CASPER_DriverIRQHandler
                BX         R0
                ENDP

PMU_PMIC_IRQHandler\
                PROC
                EXPORT     PMU_PMIC_IRQHandler        [WEAK]
                LDR        R0, =PMU_PMIC_DriverIRQHandler
                BX         R0
                ENDP

HASHCRYPT_IRQHandler\
                PROC
                EXPORT     HASHCRYPT_IRQHandler        [WEAK]
                LDR        R0, =HASHCRYPT_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM8_IRQHandler\
                PROC
                EXPORT     FLEXCOMM8_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM8_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM9_IRQHandler\
                PROC
                EXPORT     FLEXCOMM9_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM9_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM10_IRQHandler\
                PROC
                EXPORT     FLEXCOMM10_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM10_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM11_IRQHandler\
                PROC
                EXPORT     FLEXCOMM11_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM11_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM12_IRQHandler\
                PROC
                EXPORT     FLEXCOMM12_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM12_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM13_IRQHandler\
                PROC
                EXPORT     FLEXCOMM13_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM13_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM16_IRQHandler\
                PROC
                EXPORT     FLEXCOMM16_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM16_DriverIRQHandler
                BX         R0
                ENDP

I3C1_IRQHandler\
                PROC
                EXPORT     I3C1_IRQHandler        [WEAK]
                LDR        R0, =I3C1_DriverIRQHandler
                BX         R0
                ENDP

FLEXIO_IRQHandler\
                PROC
                EXPORT     FLEXIO_IRQHandler        [WEAK]
                LDR        R0, =FLEXIO_DriverIRQHandler
                BX         R0
                ENDP

LCDIF_IRQHandler\
                PROC
                EXPORT     LCDIF_IRQHandler        [WEAK]
                LDR        R0, =LCDIF_DriverIRQHandler
                BX         R0
                ENDP

GPU_IRQHandler\
                PROC
                EXPORT     GPU_IRQHandler        [WEAK]
                LDR        R0, =GPU_DriverIRQHandler
                BX         R0
                ENDP

MIPI_IRQHandler\
                PROC
                EXPORT     MIPI_IRQHandler        [WEAK]
                LDR        R0, =MIPI_DriverIRQHandler
                BX         R0
                ENDP

Reserved88_IRQHandler\
                PROC
                EXPORT     Reserved88_IRQHandler        [WEAK]
                LDR        R0, =Reserved88_DriverIRQHandler
                BX         R0
                ENDP

SDMA_IRQHandler\
                PROC
                EXPORT     SDMA_IRQHandler        [WEAK]
                LDR        R0, =SDMA_DriverIRQHandler
                BX         R0
                ENDP

Default_Handler PROC
                EXPORT     WDT0_DriverIRQHandler        [WEAK]
                EXPORT     DMA0_DriverIRQHandler        [WEAK]
                EXPORT     GPIO_INTA_DriverIRQHandler        [WEAK]
                EXPORT     GPIO_INTB_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT0_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT1_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT2_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT3_DriverIRQHandler        [WEAK]
                EXPORT     UTICK0_DriverIRQHandler        [WEAK]
                EXPORT     MRT0_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER0_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER1_DriverIRQHandler        [WEAK]
                EXPORT     SCT0_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER3_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM0_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM1_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM2_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM3_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM4_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM5_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM14_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM15_DriverIRQHandler        [WEAK]
                EXPORT     ADC0_DriverIRQHandler        [WEAK]
                EXPORT     MRT1_DriverIRQHandler        [WEAK]
                EXPORT     ACMP_DriverIRQHandler        [WEAK]
                EXPORT     DMIC0_DriverIRQHandler        [WEAK]
                EXPORT     Reserved42_DriverIRQHandler        [WEAK]
                EXPORT     HYPERVISOR_DriverIRQHandler        [WEAK]
                EXPORT     SECURE_VIOLATION_DriverIRQHandler        [WEAK]
                EXPORT     HWVAD0_DriverIRQHandler        [WEAK]
                EXPORT     Reserved46_DriverIRQHandler        [WEAK]
                EXPORT     RNG_DriverIRQHandler        [WEAK]
                EXPORT     RTC_DriverIRQHandler        [WEAK]
                EXPORT     DSP_TIE_EXPSTATE1_DriverIRQHandler        [WEAK]
                EXPORT     MU_A_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT4_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT5_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT6_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT7_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER2_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER4_DriverIRQHandler        [WEAK]
                EXPORT     OS_EVENT_DriverIRQHandler        [WEAK]
                EXPORT     FLEXSPI0_FLEXSPI1_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM6_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM7_DriverIRQHandler        [WEAK]
                EXPORT     USDHC0_DriverIRQHandler        [WEAK]
                EXPORT     USDHC1_DriverIRQHandler        [WEAK]
                EXPORT     SGPIO_INTA_DriverIRQHandler        [WEAK]
                EXPORT     SGPIO_INTB_DriverIRQHandler        [WEAK]
                EXPORT     I3C0_DriverIRQHandler        [WEAK]
                EXPORT     USB0_DriverIRQHandler        [WEAK]
                EXPORT     USB0_NEEDCLK_DriverIRQHandler        [WEAK]
                EXPORT     WDT1_DriverIRQHandler        [WEAK]
                EXPORT     USB_PHYDCD_DriverIRQHandler        [WEAK]
                EXPORT     DMA1_DriverIRQHandler        [WEAK]
                EXPORT     PUF_DriverIRQHandler        [WEAK]
                EXPORT     POWERQUAD_DriverIRQHandler        [WEAK]
                EXPORT     CASPER_DriverIRQHandler        [WEAK]
                EXPORT     PMU_PMIC_DriverIRQHandler        [WEAK]
                EXPORT     HASHCRYPT_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM8_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM9_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM10_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM11_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM12_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM13_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM16_DriverIRQHandler        [WEAK]
                EXPORT     I3C1_DriverIRQHandler        [WEAK]
                EXPORT     FLEXIO_DriverIRQHandler        [WEAK]
                EXPORT     LCDIF_DriverIRQHandler        [WEAK]
                EXPORT     GPU_DriverIRQHandler        [WEAK]
                EXPORT     MIPI_DriverIRQHandler        [WEAK]
                EXPORT     Reserved88_DriverIRQHandler        [WEAK]
                EXPORT     SDMA_DriverIRQHandler        [WEAK]

WDT0_DriverIRQHandler
DMA0_DriverIRQHandler
GPIO_INTA_DriverIRQHandler
GPIO_INTB_DriverIRQHandler
PIN_INT0_DriverIRQHandler
PIN_INT1_DriverIRQHandler
PIN_INT2_DriverIRQHandler
PIN_INT3_DriverIRQHandler
UTICK0_DriverIRQHandler
MRT0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
SCT0_DriverIRQHandler
CTIMER3_DriverIRQHandler
FLEXCOMM0_DriverIRQHandler
FLEXCOMM1_DriverIRQHandler
FLEXCOMM2_DriverIRQHandler
FLEXCOMM3_DriverIRQHandler
FLEXCOMM4_DriverIRQHandler
FLEXCOMM5_DriverIRQHandler
FLEXCOMM14_DriverIRQHandler
FLEXCOMM15_DriverIRQHandler
ADC0_DriverIRQHandler
MRT1_DriverIRQHandler
ACMP_DriverIRQHandler
DMIC0_DriverIRQHandler
Reserved42_DriverIRQHandler
HYPERVISOR_DriverIRQHandler
SECURE_VIOLATION_DriverIRQHandler
HWVAD0_DriverIRQHandler
Reserved46_DriverIRQHandler
RNG_DriverIRQHandler
RTC_DriverIRQHandler
DSP_TIE_EXPSTATE1_DriverIRQHandler
MU_A_DriverIRQHandler
PIN_INT4_DriverIRQHandler
PIN_INT5_DriverIRQHandler
PIN_INT6_DriverIRQHandler
PIN_INT7_DriverIRQHandler
CTIMER2_DriverIRQHandler
CTIMER4_DriverIRQHandler
OS_EVENT_DriverIRQHandler
FLEXSPI0_FLEXSPI1_DriverIRQHandler
FLEXCOMM6_DriverIRQHandler
FLEXCOMM7_DriverIRQHandler
USDHC0_DriverIRQHandler
USDHC1_DriverIRQHandler
SGPIO_INTA_DriverIRQHandler
SGPIO_INTB_DriverIRQHandler
I3C0_DriverIRQHandler
USB0_DriverIRQHandler
USB0_NEEDCLK_DriverIRQHandler
WDT1_DriverIRQHandler
USB_PHYDCD_DriverIRQHandler
DMA1_DriverIRQHandler
PUF_DriverIRQHandler
POWERQUAD_DriverIRQHandler
CASPER_DriverIRQHandler
PMU_PMIC_DriverIRQHandler
HASHCRYPT_DriverIRQHandler
FLEXCOMM8_DriverIRQHandler
FLEXCOMM9_DriverIRQHandler
FLEXCOMM10_DriverIRQHandler
FLEXCOMM11_DriverIRQHandler
FLEXCOMM12_DriverIRQHandler
FLEXCOMM13_DriverIRQHandler
FLEXCOMM16_DriverIRQHandler
I3C1_DriverIRQHandler
FLEXIO_DriverIRQHandler
LCDIF_DriverIRQHandler
GPU_DriverIRQHandler
MIPI_DriverIRQHandler
Reserved88_DriverIRQHandler
SDMA_DriverIRQHandler

                B       .

                ENDP


                ALIGN


                END

